performance_testing/test_results/gradual_stress_series/stress_failure_report_20users_20260519_160725/statistics.json
{
  "03_GET_Dashboard-1" : {
    "transaction" : "03_GET_Dashboard-1",
    "sampleCount" : 939,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 48.40042598509049,
    "medianResTime" : 8.0,
    "minResTime" : 3.0,
    "maxResTime" : 8305.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 153.0,
    "pct3ResTime" : 316.0,
    "throughput" : 16.99609035621199,
    "receivedKBytesPerSec" : 47.0087894867235,
    "sentKBytesPerSec" : 2.9543985189509123
  },
  "03_GET_Dashboard" : {
    "transaction" : "03_GET_Dashboard",
    "sampleCount" : 8059,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 52.46072713736191,
    "medianResTime" : 10.0,
    "minResTime" : 3.0,
    "maxResTime" : 15867.0,
    "pct1ResTime" : 134.0,
    "pct2ResTime" : 200.0,
    "pct3ResTime" : 335.1999999999989,
    "throughput" : 132.81147000659197,
    "receivedKBytesPerSec" : 93.15760894755273,
    "sentKBytesPerSec" : 25.90599185790211
  },
  "03_GET_Dashboard-0" : {
    "transaction" : "03_GET_Dashboard-0",
    "sampleCount" : 939,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 66.73162939297123,
    "medianResTime" : 10.0,
    "minResTime" : 2.0,
    "maxResTime" : 15862.0,
    "pct1ResTime" : 119.0,
    "pct2ResTime" : 183.0,
    "pct3ResTime" : 317.80000000000007,
    "throughput" : 17.091994612108195,
    "receivedKBytesPerSec" : 6.4370503453893475,
    "sentKBytesPerSec" : 2.9877607769212564
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 26071,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 45.87511027578546,
    "medianResTime" : 9.0,
    "minResTime" : 2.0,
    "maxResTime" : 15867.0,
    "pct1ResTime" : 129.0,
    "pct2ResTime" : 193.95000000000073,
    "pct3ResTime" : 340.0,
    "throughput" : 424.6091205211726,
    "receivedKBytesPerSec" : 322.32822679153094,
    "sentKBytesPerSec" : 81.47782217019544
  },
  "02_POST_Login" : {
    "transaction" : "02_POST_Login",
    "sampleCount" : 8063,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 40.91901277440157,
    "medianResTime" : 9.0,
    "minResTime" : 3.0,
    "maxResTime" : 14028.0,
    "pct1ResTime" : 116.0,
    "pct2ResTime" : 181.0,
    "pct3ResTime" : 324.71999999999935,
    "throughput" : 133.83461142648477,
    "receivedKBytesPerSec" : 89.1300096686917,
    "sentKBytesPerSec" : 34.242840032948244
  },
  "01_GET_Login" : {
    "transaction" : "01_GET_Login",
    "sampleCount" : 8071,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 41.53016974352605,
    "medianResTime" : 9.0,
    "minResTime" : 3.0,
    "maxResTime" : 12545.0,
    "pct1ResTime" : 118.0,
    "pct2ResTime" : 184.39999999999964,
    "pct3ResTime" : 336.5599999999995,
    "throughput" : 131.4495114006515,
    "receivedKBytesPerSec" : 94.749879122557,
    "sentKBytesPerSec" : 16.944663578990227
  }
}