performance_testing/test_results/gradual_stress_series/stress_failure_report_60users_20260519_160957/statistics.json
{
  "03_GET_Dashboard-1" : {
    "transaction" : "03_GET_Dashboard-1",
    "sampleCount" : 1891,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 275.92014806980376,
    "medianResTime" : 89.0,
    "minResTime" : 3.0,
    "maxResTime" : 54858.0,
    "pct1ResTime" : 490.79999999999995,
    "pct2ResTime" : 681.5999999999995,
    "pct3ResTime" : 965.4799999999996,
    "throughput" : 23.059007157925542,
    "receivedKBytesPerSec" : 63.796145069933054,
    "sentKBytesPerSec" : 4.0083039786237755
  },
  "03_GET_Dashboard" : {
    "transaction" : "03_GET_Dashboard",
    "sampleCount" : 6214,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 247.66720308979768,
    "medianResTime" : 18.0,
    "minResTime" : 3.0,
    "maxResTime" : 55016.0,
    "pct1ResTime" : 503.5,
    "pct2ResTime" : 729.0,
    "pct3ResTime" : 1371.8500000000004,
    "throughput" : 75.76755188138611,
    "receivedKBytesPerSec" : 92.48584130834371,
    "sentKBytesPerSec" : 17.252485094008343
  },
  "03_GET_Dashboard-0" : {
    "transaction" : "03_GET_Dashboard-0",
    "sampleCount" : 1891,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 357.54204124801686,
    "medianResTime" : 105.0,
    "minResTime" : 2.0,
    "maxResTime" : 53995.0,
    "pct1ResTime" : 489.79999999999995,
    "pct2ResTime" : 732.0,
    "pct3ResTime" : 1061.079999999998,
    "throughput" : 23.068289945592507,
    "receivedKBytesPerSec" : 8.687241438596384,
    "sentKBytesPerSec" : 4.03244521509869
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 22458,
    "errorCount" : 1,
    "errorPct" : 0.004452756,
    "meanResTime" : 212.19814765339768,
    "medianResTime" : 32.0,
    "minResTime" : 2.0,
    "maxResTime" : 55016.0,
    "pct1ResTime" : 454.0,
    "pct2ResTime" : 649.0,
    "pct3ResTime" : 1135.0,
    "throughput" : 273.6011110705018,
    "receivedKBytesPerSec" : 340.44908240744127,
    "sentKBytesPerSec" : 54.46465248970554
  },
  "02_POST_Login" : {
    "transaction" : "02_POST_Login",
    "sampleCount" : 6224,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 140.35748714652962,
    "medianResTime" : 15.0,
    "minResTime" : 3.0,
    "maxResTime" : 52275.0,
    "pct1ResTime" : 377.0,
    "pct2ResTime" : 523.75,
    "pct3ResTime" : 944.25,
    "throughput" : 77.66505696352588,
    "receivedKBytesPerSec" : 87.70463224444403,
    "sentKBytesPerSec" : 19.870772384544356
  },
  "01_GET_Login" : {
    "transaction" : "01_GET_Login",
    "sampleCount" : 6238,
    "errorCount" : 1,
    "errorPct" : 0.01603078,
    "meanResTime" : 185.16832318050675,
    "medianResTime" : 17.0,
    "minResTime" : 3.0,
    "maxResTime" : 53533.0,
    "pct1ResTime" : 376.0,
    "pct2ResTime" : 529.0,
    "pct3ResTime" : 942.659999999998,
    "throughput" : 75.99624770049827,
    "receivedKBytesPerSec" : 90.00071050415433,
    "sentKBytesPerSec" : 9.794820867292863
  }
}